package module03;

public class Lesson07_solid {
    public static void main(String[] args) {
        /* 1. SOLID нужен для правильного построения структуры приложения, что бы в дальнешей разработке
        приложения, его можно было бы легче модефицировать или расширять.
           2. Принцип единственной ответственности (SRP). Насколько уж я понял, если у нас есть класс
           который может измениться по нескольким причинам, то лучше будет разбить этот класс на несколько,
           что бы у каждого класса была своя ответственность.
           3. Принцип открытости/закрытости (OCP).
        * */
    }
}
